
#include<iostream>
using namespace std;
int main()
{
    int n,space=0,i,j;//i и j са работни променливи
    //n-числото,въведено от клавиатурата(брой редове)
    //space-броя на интервалитев текущия ред,на първия ред интервалите са нула
    cin>>n;
    for(i=n;i>=1;i--)//Този цикъл отброява по колко зжездички се отпечатват на текушия ред
    //първо се печата реда с n звездички,после с n-1 ,докато се достигне до реда с 1 звезда
    {
     for(j=1;j<=space;j++)//извежда space на брой интервали,започват от един и са повече от интервалите в предния ред
            cout<<' ';//извеждат се интервали
      for(j=1;j<=i;j++) // извежда i на брой звездички
        cout<<'*';//oтпечатва необходимия брой звездички
        cout<<endl;
      space++;//увеличава се броя на интервалите
    }
	return 0;
}
